#+title: AwesomeWM configuration
#+setupfile: headers
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak's AwesomeWM config" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak's AwesomeWM config" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the AwesomeWM config file of Phundrak" />
#+PROPERTY: header-args :noweb yes :tangle no :exports none
#+PROPERTY: header-args:lua :tangle ~/.config/awesome/rc.lua :exports code :noweb yes :mkdirp yes

* Loading libraries
:PROPERTIES:
:CUSTOM_ID: Loading_libraries-4df76999
:END:
First of all, some initialization is needed, and this initialization is about
math randomness. So, let’s initialize the ~random~ method of the ~math~ library:
#+BEGIN_SRC lua
  math.randomseed(os.time())
#+END_SRC

In order to be able to load libraries properly, I first need to make sure
LuaRocks is installed, so I can also make sure the packages our configuration
depends on installed through it can be found. If LuaRocks is not installed, then
do nothing.
#+BEGIN_SRC lua
  pcall(require, "luarocks.loader")
#+END_SRC

Next, we’ll also load the following libraries
#+NAME: table-imported-libraries
| Library             | Import as     | What it is                |
|---------------------+---------------+---------------------------|
| gears               | gears         | Standard Awesome library  |
| awful               | awful         | Standard Awesome library  |
| wibox               | wibox         | Widget and layout library |
| beautiful           | beautiful     | Theme handling library    |
| naughty             | naughty       | Notification library      |
| menubar             | menubar       | Create menus              |
| awful.hotkeys_popup | hotkeys_popup | Help window for hotkeys   |

#+NAME: imported-libraries
#+BEGIN_SRC emacs-lisp :var libs=table-imported-libraries :cache yes
  (mapconcat (lambda (x) (format "local %s = require(\"%s\")"
                                 (cadr x)
                                 (car x)))
             libs
             "\n")
#+END_SRC

#+RESULTS[a66d7b66dbd4b4001dc3f649840b66761cc915b5]: imported-libraries
: local gears = require("gears")
: local awful = require("awful")
: local wibox = require("wibox")
: local beautiful = require("beautiful")
: local naughty = require("naughty")
: local menubar = require("menubar")
: local hotkeys_popup = require("awful.hotkeys_popup")

Here is the actual code in the config file:
#+BEGIN_SRC lua
<<imported-libraries()>>
#+END_SRC

I also want to be able to autofocus the first window when I go to another workspace, so let’s require that:
#+BEGIN_SRC lua
  require("awful.autofocus")
#+END_SRC

And finally, I want to be able to declare some shortcuts specific to some apps
thanks to the hotkeys help widget.
#+BEGIN_SRC lua
  require("awful.hotkeys_popup.keys")
#+END_SRC
By the way, let’s initialize the ~random~ method of the ~math~ library:
#+BEGIN_SRC lua
  math.randomseed(os.time())
#+END_SRC

* Layouts
:PROPERTIES:
:CUSTOM_ID: Layouts-be55a7fd
:END:
The following is a list of available windows layouts. I only enable some of
them, and their order in the table is their order in Awesome.
#+NAME: table-layouts
| Layout          | Enabled? |
|-----------------+----------|
| magnifier       | yes      |
| tile.left       | yes      |
| tile            | yes      |
| tile.bottom     | yes      |
| tile.top        | yes      |
| max             | yes      |
| max.fullscreen  | yes      |
| floating        | yes      |
| fair            | yes      |
| fair.horizontal | yes      |
| spiral          | yes      |
| spiral.dwindle  | yes      |
| corner.nw       | no       |
| corner.ne       | no       |
| corner.sw       | no       |
| corner.se       | no       |

#+NAME: list-layouts
#+BEGIN_SRC emacs-lisp :var layouts=table-layouts :cache yes
  (mapconcat (lambda (x) (if (string= (cadr x) "yes")
                             (format "awful.layout.suit.%s,\n" (car x))))
             layouts
             "")
#+END_SRC

#+RESULTS[0bd0312ff10526c8b24199453ff235cf71425fb5]: list-layouts
#+begin_example
awful.layout.suit.magnifier,
awful.layout.suit.tile,
awful.layout.suit.tile.left,
awful.layout.suit.tile.bottom,
awful.layout.suit.tile.top,
awful.layout.suit.max,
awful.layout.suit.max.fullscreen,
awful.layout.suit.floating,
awful.layout.suit.fair,
awful.layout.suit.fair.horizontal,
awful.layout.suit.spiral,
awful.layout.suit.spiral.dwindle,
#+end_example

Here is the code that activates these layouts:
#+BEGIN_SRC lua
  awful.layout.layouts = {
    <<list-layouts()>>
  }
#+END_SRC

** Menus
:PROPERTIES:
:CUSTOM_ID: Top_bar-Menus-cf468ca8
:END:
#+NAME: make-menu
#+BEGIN_SRC emacs-lisp :var menu=table-awesome-menu
  (mapconcat (lambda (x)
               (format "{ \"%s\", %s }"
                       (car x)
                       (mapconcat (lambda (y) (format "%s" y))
                                  (cdr x)
                                  ",")))
             menu
             ",\n")
#+END_SRC

#+RESULTS: make-menu
: { "hotkeys", function() hotkeys_popup.show_help(nil, awful.screen.focused()) end }
: { "edit config", editor .. " " .. awesome.conffile }
: { "restart", awesome.restart }
: { "quit", function() awesome.quit() end }

It is possible to create actual menus in Awesome, including the one available at
the top-left corner of the screen. First, let’s declare a menu related to
Awesome:
#+NAME: table-awesome-menu
| Name        | Command                                                             |
|-------------+---------------------------------------------------------------------|
| hotkeys     | function() hotkeys_popup.show_help(nil, awful.screen.focused()) end |
| edit config | editor .. " " .. awesome.conffile                                   |
| restart     | awesome.restart                                                     |
| quit        | function() awesome.quit() end                                       |

And here is the actual code:
#+BEGIN_SRC lua
  awesomewm_menu = {
    <<make-menu(menu=table-awesome-menu)>>
  }
#+END_SRC

Next, let’s create the main menu that will be used on ~S-w~ and at the top left
of the window:
#+NAME: table-main-menu
| Name          | Command        | Icon                   |
|---------------+----------------+------------------------|
| awesome       | awesomewm_menu | beautiful.awesome_icon |
| open terminal | terminal       | nil                    |

Here is the actual code:
#+BEGIN_SRC lua
  mainmenu = awful.menu({ items = {
                            <<make-menu(menu=table-main-menu)>>
                       }})
#+END_SRC

For now it only has two entries: the Awesome menu and opening a terminal, I will
add some more later probably. Let’s specify it as being our main launcher:
#+BEGIN_SRC lua
  launcher = awful.widget.launcher({ image = beautiful.awesome_icon,
                                     menu = mainmenu })
#+END_SRC

Finally, let’s declare the menubar’s terminal for applications that require it.
#+BEGIN_SRC lua
  menubar.utils.terminal = terminal
#+END_SRC

* Keybindings
:PROPERTIES:
:CUSTOM_ID: Keybindings-a4e415b3
:END:
Keybindings allow the user to execute some Lua code all across Awesome. They all
bear at least a list of modifier keys, the actual key to be pressed, the action
they keybinding should yield, a description, and a group. The latter two will be
useful for the keybindings help window which will display them all, sorted by
group and with the description displayed next to the keybinding itself.

Here are some keybindings related to Awesome itself. Most of them will be
described in tables, but due to some limitations from Org-mode (the Emacs mode
used to write this document and generate my Awesome configuration), a few of
them will be directly written as Lua code.

Here is a description of the tables displayed below:
- Key :: key which toggles the shortcut
- Modifiers :: modifier keys that are required to toggle the shortcut
- Lambda? :: whether or not the ~Action~ should be nested in a lambda function.
  Possible values are:
  - ~no~ :: The value is a Lua function to be executed as is
  - ~yes~ :: The value is to be inserted into a lambda
  - ~spawn~ :: The value is to be inserted in an ~awful.spawn~ call in a lambda
  - ~shell~ :: The value is to be inserted in an ~awful.spawn.with_shell~ call
    in a lambda
- Action :: code to be executed by the shortcut
- What it does :: short description of the shortcut’s action
- Group :: group in which the shortcut will appear in Awesome’s help window
- Clientkey? :: whether this should be a global shortcut or a shortcut only
  aimed at clients (value is ~yes~ or ~no~)

#+NAME: gen-sc-text
#+BEGIN_SRC emacs-lisp
  (lambda (x)
    (format "awful.key({%s},\"%s\",%s,\n\t{description=\"%s\",group=\"%s\"})"
            (nth 1 x) (nth 0 x)
            (cond
             ((string= "yes" (nth 2 x))
              (format "function(%s) %s end"
                      (if (string= (nth 6 x) "yes") "c" "")
                      (nth 3 x)))
             ((string= "shell" (nth 2 x))
              (format "function(%s) awful.spawn.with_shell(\"%s\") end"
                      (if (string= (nth 6 x) "yes") "c" "")
                      (nth 3 x)))
             ((string= "terminal" (nth 2 x))
              (format "function(%s) awful.spawn(terminal..\" -e %s\") end"
                      (if (string= (nth 6 x) "yes") "c" "")
                      (nth 3 x)))
             ((string= "spawn" (nth 2 x))
              (format "function(%s) awful.spawn(\"%s\") end"
                      (if (string= (nth 6 x) "yes") "c" "")
                      (nth 3 x)))
             (t (nth 3 x)))
            (nth 4 x) (nth 5 x)))
#+END_SRC

#+NAME: gen-sc-glob
#+BEGIN_SRC emacs-lisp :var table=sc-client
  (mapconcat
   <<gen-sc-text>>
   (seq-filter (lambda (x)
                 (or (not (nth 6 x))
                     (string= "no" (nth 6 x))))
               table)
   ",\n")
#+END_SRC

#+NAME: gen-sc-client
#+BEGIN_SRC emacs-lisp :var table=sc-client :cache yes
  (mapconcat
   <<gen-sc-text>>
   (seq-filter (lambda (x)
                 (string= "yes" (nth 6 x)))
               table)
   ",\n")
#+END_SRC

#+RESULTS[5a0293b89fe106cb2b71ba10d9548b29aa2f9543]: gen-sc-client
#+begin_example
awful.key({modkey},"f",function(c) toggle_fullscreen_client(c) end,
  {description="toggle fullscreen",group="client"}),
awful.key({modkey},"m",function(c) toggle_maximized(c) end,
  {description="toggle maximized",group="client"}),
awful.key({modkey, control},"m",function(c) toggle_vertical_maximized(c) end,
  {description="toggle vertically maximized",group="client"}),
awful.key({modkey, shift},"m",function(c) toggle_horizontal_maximized(c) end,
  {description="toggle horizontally maximized",group="client"}),
awful.key({modkey, shift},"n",function(c) c.minimized = true end,
  {description="minimize",group="client"}),
awful.key({modkey},"o",function(c) c:move_to_screen() end,
  {description="move to screen",group="client"}),
awful.key({modkey},"q",function(c) c:kill() end,
  {description="close client",group="client"}),
awful.key({modkey},"v",function(c) c.ontop = not c.ontop end,
  {description="toggle keep on top",group="client"}),
awful.key({modkey, control},"space",awful.client.floating.toggle,
  {description="toggle floating",group="client"}),
awful.key({modkey, control},"Return",function(c) c:swap(awful.client.getmaster()) end,
  {description="move to master",group="client"})
#+end_example

#+NAME: sc-tag-num-gen
#+BEGIN_SRC emacs-lisp :var input=sc-tag-num :results drawer
  (let (result)
    (dotimes (i 10 result)
      (let* ((j (+ 1 i)))
        (setq result
              (cons
               (mapconcat
                (lambda (line)
                  (format
                   "awful.key({%s},\"#%d\",function() %s%d) end,
  \t{description=\"%s%d\",group=\"%s\"})"
                   (nth 1 line) (+ j 9) (nth 2 line) j
                   (nth 3 line) j (nth 4 line)))
                input
                ",\n") result))))
    (mapconcat (lambda (x) x)
               result
               ",\n\n"))
#+END_SRC

Most of these keybindings are available at root-level of Awesome and will be
declared in the ~globalkeys~ variable, which will be added then to ~root.keys~
(see [[https://awesomewm.org/doc/api/libraries/root.html#keys]]).
#+BEGIN_SRC lua :cache yes
  globalkeys = gears.table.join(
    -- Awesome
    <<gen-sc-glob(sc-awesome)>>,
    -- App
    <<gen-sc-glob(sc-app)>>,
    <<gen-sc-glob(sc-app-internet)>>,
    <<gen-sc-glob(sc-app-screenshot)>>,
    <<gen-sc-glob(sc-app-emacs)>>,
    <<gen-sc-glob(sc-app-rofi)>>,
    -- Client
    <<gen-sc-glob(sc-client)>>,
    -- Layout
    <<gen-sc-glob(sc-layout)>>,
    -- Media
    <<gen-sc-glob(sc-media)>>,
    -- Screen
    <<gen-sc-glob(sc-screen)>>,
    -- Tags
    <<gen-sc-glob(sc-tag)>>,
    -- Misc
    <<gen-sc-glob(sc-misc)>>,
    <<sc-tag-num-gen()>>
  )
  root.keys(globalkeys)

  clientkeys = gears.table.join(
    -- Client
    <<gen-sc-client(sc-client)>>
  )
#+END_SRC

** Universal rules
:PROPERTIES:
:CUSTOM_ID: Rules-Universal_rules-50aad2ce
:END:
The first rule is a universal rule which will match all clients, as you can see
with its syntax below:
#+BEGIN_SRC lua :tangle no
  { rule = {},
    properties = {
      -- List of properties
    }
  }
#+END_SRC

Here is the list of properties with their value to apply to all clients, and a
short explanation as to what they do.
#+NAME: rules-universal-properties-table
| Property      | Value                                                   | What it does                                                            |
|---------------+---------------------------------------------------------+-------------------------------------------------------------------------|
| border_width  | beautiful.border_width                                  | Set the width of the window’s border                                    |
| border_color  | beautiful.border_normal                                 | Set the color of the window’s border                                    |
| focus         | awful.client.focus.filter                               | Set focus on the new window, except filtered out windows                |
| raise         | true                                                    | Set it as raised window                                                 |
| keys          | clientkeys                                              | Set the client’s shortcuts set in [[*Clients][Shortcuts/Clients]]                     |
| buttons       | clientbuttons                                           | Set the client’s mouse shortcuts from [[#Mouse_bindings-eb4a69a8][Mouse bindings]]                    |
| screen        | awful.screen.preferred                                  | Spawn the client on the main screen                                     |
| placement     | awful.placement.no_overlap+awful.placement.no_offscreen | Avoid the client to appear off the screen and overlaping another client |
| round_corners | true                                                    | Enable rounded corners for client                                       |

#+NAME: rules-universal-properties
#+BEGIN_SRC emacs-lisp :tangle no :exports none :var properties=rules-universal-properties-table :cache yes
  (mapconcat (lambda (x)
               (format "%s = %s"
                       (car x)
                       (cadr x)))
             properties
             ",\n")
#+END_SRC

#+RESULTS[5ddcb42f901ac56237de5ed102800b588f462100]: rules-universal-properties
: border_width = beautiful.border_width,
: border_color = beautiful.border_normal,
: focus = awful.client.focus.filter,
: raise = true,
: keys = clientkeys,
: buttons = clientbuttons,
: screen = awful.screen.preferred,
: placement = awful.placement.no_overlap+awful.placement.no_offscreen,
: round_corners = true

This is what my universal rules look like:
#+NAME: rules-universal
#+BEGIN_SRC lua :tangle no
   { rule = {},
     properties = {
       <<rules-universal-properties()>>
     }
   }
#+END_SRC

** Floating clients
:PROPERTIES:
:CUSTOM_ID: Rules-Floating_clients-49ab582e
:END:
Some clients will be declared by default as floating windows. For this, we will
declare a rule that will match any of the provided conditions:
#+NAME: rules-floating-conditions-table
| Property | Matches      | Comment                                                        |
|----------+--------------+----------------------------------------------------------------|
| instance | pinentry     | Matches any Polkit                                             |
| class    | Arandr       | Visual frontend for Randr                                      |
| class    | Sxiv         | Simple X Image Viewer                                          |
| class    | Tor Browser  | Needs a fixed window size to avoid fingerprinting              |
| name     | Event Tester | xev                                                            |
| role     | pop-up       | Any pop-up window, such as Chromium’s detached Developer Tools |

#+NAME: rules-floating-conditions
#+BEGIN_SRC emacs-lisp :exports none :tangle no :var conditions=rules-floating-conditions-table :cache yes
  (mapconcat (lambda (x)
               (format "%s = { \"%s\" }" (car x) (cadr x)))
             conditions
             ",\n")
#+END_SRC

#+RESULTS[1fbe7dc1e85b5170957c9583e39c4cbec9a7d7ca]: rules-floating-conditions
: instance = { "pinentry" },
: class = { "Arandr" },
: class = { "Sxiv" },
: class = { "Tor Browser" },
: name = { "Event Tester" },
: role = { "pop-up" }

If any of these conditions is matched, then the client will be set as floating,
as you can see below:
#+NAME: rules-floating
#+BEGIN_SRC lua :tangle no
  { rule_any = {
      <<rules-floating-conditions()>>
  }, properties = { floating = true }}
#+END_SRC

** Default tag for clients
:PROPERTIES:
:CUSTOM_ID: Rules-Default_tag_for_clients-6ded2a47
:END:
With the use of some rules, it is possible to define which client are assigned
to which tag by default.
#+NAME: rules-default-tags-table
| Client Property | Value      | Tag |
|-----------------+------------+-----|
| class           | Emacs      |   2 |
| class           | firefox    |   3 |
| class           | Nemo       |   4 |
| class           | Gimp*      |   5 |
| class           | Steam      |   8 |
| class           | Mattermost |   9 |
| class           | discord    |   0 |
| class           | lightcord  |   0 |

#+NAME: rules-default-tags-generate
#+BEGIN_SRC emacs-lisp :tangle no :exports none :cache yes :var tags=rules-default-tags-table
  (mapconcat (lambda (x)
               (format "{rule = {%s = \"%s\"}, properties = {screen = 1, tag = \"%d\"} }"
                       (nth 0 x) (nth 1 x) (nth 2 x)))
             tags
             ",\n")
#+END_SRC

#+RESULTS[ec74b9e45bd477d22e2865de30a9c64973cf0927]: rules-default-tags-generate
: {rule = {class = "Emacs"}, properties = {screen = 1, tag = "2"} },
: {rule = {class = "firefox"}, properties = {screen = 1, tag = "3"} },
: {rule = {class = "Nemo"}, properties = {screen = 1, tag = "4"} },
: {rule = {class = "Gimp*"}, properties = {screen = 1, tag = "5"} },
: {rule = {class = "discord"}, properties = {screen = 1, tag = "0"} },
: {rule = {class = "mattermost"}, properties = {screen = 1, tag = "0"} },
: {rule = {class = "Steam"}, properties = {screen = 1, tag = "9"} }

This is what these rules look like:
#+NAME: rules-default-tags
#+BEGIN_SRC lua :tangle no
  <<rules-default-tags-generate()>>
#+END_SRC

